[notebook](http://localhost:8888/notebooks/scripts/19.ipynb)

In [47]:
import pandas as pd
from IPython.display import display
pd.set_option('display.max_rows', 5)

In [48]:
drinks = pd.read_csv('../data/drinks.csv')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
...,...,...,...,...,...,...
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [49]:
# index: get dataframe index
print(drinks.index)
type(drinks.index)

RangeIndex(start=0, stop=193, step=1)

pandas.indexes.range.RangeIndex

In [50]:
# index: set index from 1 to n
display(drinks.index[0:19])
display(drinks.index[0:19] + 1)
drinks.index = drinks.index + 1
drinks

RangeIndex(start=0, stop=19, step=1)

RangeIndex(start=1, stop=20, step=1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Afghanistan,0,0,0,0.0,Asia
2,Albania,89,132,54,4.9,Europe
...,...,...,...,...,...,...
192,Zambia,32,19,4,2.5,Africa
193,Zimbabwe,64,18,4,4.7,Africa

In [51]:
# column names are also stored in a special "index" object
drinks.columns

Index([u'country', u'beer_servings', u'spirit_servings', u'wine_servings',
       u'total_litres_of_pure_alcohol', u'continent'],
      dtype='object')

In [52]:
drinks.shape

(193, 6)

In [53]:
pd.read_table('../data/u.user.txt', header=None, sep='|')

       0   1  2           3      4
0      1  24  M  technician  85711
1      2  53  F       other  94043
..   ...  .. ..         ...    ...
941  942  48  F   librarian  78209
942  943  22  M     student  77841

[943 rows x 5 columns]

In [54]:
drinks[drinks.continent=='South America']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
7,Argentina,193,25,221,8.3,South America
21,Bolivia,167,41,8,3.8,South America
...,...,...,...,...,...,...
186,Uruguay,115,35,220,6.6,South America
189,Venezuela,333,100,3,7.7,South America

In [55]:
drinks.loc[23, 'beer_servings']

173

In [56]:
# set_index: use column as index
drinks.set_index('country', inplace=True)
drinks

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
...,...,...,...,...,...
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

In [57]:
print(drinks.index)
len(drinks.index)

Index([u'Afghanistan', u'Albania', u'Algeria', u'Andorra', u'Angola',
       u'Antigua & Barbuda', u'Argentina', u'Armenia', u'Australia',
       u'Austria',
       ...
       u'Tanzania', u'USA', u'Uruguay', u'Uzbekistan', u'Vanuatu',
       u'Venezuela', u'Vietnam', u'Yemen', u'Zambia', u'Zimbabwe'],
      dtype='object', name=u'country', length=193)

193

In [58]:
# 'country' is no longer a column
drinks.columns

Index([u'beer_servings', u'spirit_servings', u'wine_servings',
       u'total_litres_of_pure_alcohol', u'continent'],
      dtype='object')

In [59]:
drinks.shape

(193, 5)

In [60]:
# loc: select by [indexName, columnName]
drinks.loc['Brazil', 'beer_servings']

245

In [61]:
# index.name: set index name
drinks.index.name = None    
drinks

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
...,...,...,...,...,...
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

In [62]:
# restore the index name, and move the index back to a column
drinks.index.name = 'country'
# drinks.reset_index(inplace=True) 
drinks

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
...,...,...,...,...,...
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

In [63]:
drinks.index

Index([u'Afghanistan', u'Albania', u'Algeria', u'Andorra', u'Angola',
       u'Antigua & Barbuda', u'Argentina', u'Armenia', u'Australia',
       u'Austria',
       ...
       u'Tanzania', u'USA', u'Uruguay', u'Uzbekistan', u'Vanuatu',
       u'Venezuela', u'Vietnam', u'Yemen', u'Zambia', u'Zimbabwe'],
      dtype='object', name=u'country', length=193)

In [66]:
# many DataFrame methods output a DataFrame
display(drinks.describe().head(10))

pd.set_option('display.max_rows', 10)
drinks.describe().head(10)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
...,...,...,...,...
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [65]:
# you can interact with any DataFrame using its index and columns
drinks.describe().loc['25%', 'beer_servings']

20.0